OpenPuya/PY32F0xx_Firmware/Packs/GCC/.pack/Puya/PY32F0xx_DFP/CMSIS/SVD/py32f071cxx.svd
        <register>
          <name>EXTICR4</name>
          <displayName>EXTICR4</displayName>
          <description>EXTI external interrupt selection register</description>
          <addressOffset>0x6C</addressOffset>
          <fields>
            <field>
              <name>EXTI12</name>
              <description>GPIO port selection</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>EXTI13</name>
              <description>GPIO port selection</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>EXTI14</name>
              <description>GPIO port selection</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>EXTI15</name>
              <description>GPIO port selection</description>
              <bitRange>[25:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <displayName>IMR</displayName>
          <description>EXTI CPU wakeup with interrupt mask register</description>
          <addressOffset>0x80</addressOffset>
          <resetValue>0xFFF80000</resetValue>
          <fields>
            <field>
              <name>IM0</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IM1</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IM2</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>IM3</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>IM4</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IM5</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IM6</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>IM7</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IM8</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IM9</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IM10</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IM11</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>IM12</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>IM13</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>IM14</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IM15</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>IM16</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>IM17</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>IM18</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>IM19</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>IM20</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IM29</name>
              <description>CPU wakeup with interrupt mask on event input</description>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMR</name>
          <displayName>EMR</displayName>
          <description>EXTI CPU wakeup with event mask register</description>
          <addressOffset>0x84</addressOffset>
          <fields>
            <field>
              <name>EM0</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EM1</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EM2</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EM3</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EM4</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EM5</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EM6</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EM7</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EM8</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EM9</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EM10</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>EM11</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>EM12</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>EM13</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EM14</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>EM15</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>EM16</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EM17</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EM18</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EM19</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>EM20</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>EM29</name>
              <description>CPU wakeup with event mask on event input</description>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
